<a href="https://colab.research.google.com/github/GNuSeekK/ICTCOG/blob/main/2_06_%5Bpandas%5D_%EB%8D%B0%EC%9D%B4%ED%84%B0_%EC%84%A0%ED%83%9D%2C_%EA%B2%B0%EC%B8%A1%EA%B0%92_%EC%83%89%EC%9D%B8.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [3]:
import pandas as pd

In [4]:
path = '/content/drive/MyDrive/ICTCOG 인공지능과정/Data/korean-idol.csv'
df = pd.read_csv(path)
df.head()

     이름     그룹  소속사  성별        생년월일      키 혈액형   브랜드평판지수
0    지민  방탄소년단  빅히트  남자  1995-10-13  173.6   A  10523260
1  지드래곤     빅뱅   YG  남자  1988-08-18  177.0   A   9916947
2  강다니엘    NaN  커넥트  남자  1996-12-10  180.0   A   8273745
3     뷔  방탄소년단  빅히트  남자  1995-12-30  178.0  AB   8073501
4    화사    마마무  RBW  여자  1995-07-23  162.1   A   7650928

# 컬럼 선택하기
* 대괄호 `[]` 안에 컬럼의 이름을 집어 넣어서 선택하거나, 인덱스를 집어 넣어서 선택
* 컬럼의 이름을 사용하는 것을 적극 추천

In [ ]:
df['이름'] # 시리즈를 선택 하는 것

0       지민
1     지드래곤
2     강다니엘
3        뷔
4       화사
5       정국
6       민현
7       소연
8        진
9      하성운
10      태연
11     차은우
12      백호
13      JR
14      슈가
Name: 이름, dtype: object

In [ ]:
df[['이름','그룹','생년월일']]

      이름     그룹        생년월일
0     지민  방탄소년단  1995-10-13
1   지드래곤     빅뱅  1988-08-18
2   강다니엘    NaN  1996-12-10
3      뷔  방탄소년단  1995-12-30
4     화사    마마무  1995-07-23
5     정국  방탄소년단  1997-09-01
6     민현   뉴이스트  1995-08-09
7     소연    아이들  1998-08-26
8      진  방탄소년단  1992-12-04
9    하성운     핫샷  1994-03-22
10    태연   소녀시대  1989-03-09
11   차은우   아스트로  1997-03-30
12    백호   뉴이스트  1995-07-21
13    JR   뉴이스트  1995-06-08
14    슈가  방탄소년단  1993-03-09

In [ ]:
column_names = ['이름','그룹','생년월일']
df[column_names]

      이름     그룹        생년월일
0     지민  방탄소년단  1995-10-13
1   지드래곤     빅뱅  1988-08-18
2   강다니엘    NaN  1996-12-10
3      뷔  방탄소년단  1995-12-30
4     화사    마마무  1995-07-23
5     정국  방탄소년단  1997-09-01
6     민현   뉴이스트  1995-08-09
7     소연    아이들  1998-08-26
8      진  방탄소년단  1992-12-04
9    하성운     핫샷  1994-03-22
10    태연   소녀시대  1989-03-09
11   차은우   아스트로  1997-03-30
12    백호   뉴이스트  1995-07-21
13    JR   뉴이스트  1995-06-08
14    슈가  방탄소년단  1993-03-09

# 범위 선택

In [5]:
df[:3] #0~2번까지

     이름     그룹  소속사  성별        생년월일      키 혈액형   브랜드평판지수
0    지민  방탄소년단  빅히트  남자  1995-10-13  173.6   A  10523260
1  지드래곤     빅뱅   YG  남자  1988-08-18  177.0   A   9916947
2  강다니엘    NaN  커넥트  남자  1996-12-10  180.0   A   8273745

In [6]:
df.head(3)

     이름     그룹  소속사  성별        생년월일      키 혈액형   브랜드평판지수
0    지민  방탄소년단  빅히트  남자  1995-10-13  173.6   A  10523260
1  지드래곤     빅뱅   YG  남자  1988-08-18  177.0   A   9916947
2  강다니엘    NaN  커넥트  남자  1996-12-10  180.0   A   8273745

## loc 선택
* location 의 약자
* loc[행 선택, 열 선택]
    * 행 선택 : 행의 인덱스를 활용, True/False로 이루어진 조건 색인(인덱싱)
    * 열 선택 : 컬럼의 이름(들)

In [7]:
df.loc[:,'이름']

0       지민
1     지드래곤
2     강다니엘
3        뷔
4       화사
5       정국
6       민현
7       소연
8        진
9      하성운
10      태연
11     차은우
12      백호
13      JR
14      슈가
Name: 이름, dtype: object

In [9]:
df.loc[:,['이름','생년월일']]

      이름        생년월일
0     지민  1995-10-13
1   지드래곤  1988-08-18
2   강다니엘  1996-12-10
3      뷔  1995-12-30
4     화사  1995-07-23
5     정국  1997-09-01
6     민현  1995-08-09
7     소연  1998-08-26
8      진  1992-12-04
9    하성운  1994-03-22
10    태연  1989-03-09
11   차은우  1997-03-30
12    백호  1995-07-21
13    JR  1995-06-08
14    슈가  1993-03-09

In [10]:
df.loc[3:8,['이름','키']]

   이름      키
3   뷔  178.0
4  화사  162.1
5  정국  178.0
6  민현  182.3
7  소연    NaN
8   진  179.2

## iloc(포지션 선택)
* 배열의 인덱스 개념을 사용하는 것

In [11]:
df.head()

     이름     그룹  소속사  성별        생년월일      키 혈액형   브랜드평판지수
0    지민  방탄소년단  빅히트  남자  1995-10-13  173.6   A  10523260
1  지드래곤     빅뱅   YG  남자  1988-08-18  177.0   A   9916947
2  강다니엘    NaN  커넥트  남자  1996-12-10  180.0   A   8273745
3     뷔  방탄소년단  빅히트  남자  1995-12-30  178.0  AB   8073501
4    화사    마마무  RBW  여자  1995-07-23  162.1   A   7650928

In [12]:
df.iloc[:,[0,2]]

      이름      소속사
0     지민      빅히트
1   지드래곤       YG
2   강다니엘      커넥트
3      뷔      빅히트
4     화사      RBW
5     정국      빅히트
6     민현     플레디스
7     소연       큐브
8      진      빅히트
9    하성운  스타크루이엔티
10    태연       SM
11   차은우     판타지오
12    백호     플레디스
13    JR     플레디스
14    슈가      빅히트

In [13]:
df.iloc[1:5,[0,2]]

     이름  소속사
1  지드래곤   YG
2  강다니엘  커넥트
3     뷔  빅히트
4    화사  RBW

In [14]:
df.iloc[1:5,1:4]

      그룹  소속사  성별
1     빅뱅   YG  남자
2    NaN  커넥트  남자
3  방탄소년단  빅히트  남자
4    마마무  RBW  여자

# Boolean Indexing - 조건 색인
* 특정한 조건을 이용해서 그 조건을 만족하는(True) 데이터만 추출
1. 조건 마스크를 생성한다.
    * True / False로 이루어진 배열을 만드는 것
    * 조건에 맞으면 True / 조건에 안맞으면 False
2. 생성된 조건 마스크를 색인 위치에 넣기

In [16]:
# 키가 180 초과 - 조건 마스크
df['키'] > 180

0     False
1     False
2     False
3     False
4     False
5     False
6      True
7     False
8     False
9     False
10    False
11     True
12    False
13    False
14    False
Name: 키, dtype: bool

In [17]:
df[df['키'] < 170]

    이름   그룹      소속사  성별        생년월일      키 혈액형  브랜드평판지수
4   화사  마마무      RBW  여자  1995-07-23  162.1   A  7650928
9  하성운   핫샷  스타크루이엔티  남자  1994-03-22  167.1   A  4036489

조건 인덱싱, 컬럼 선택을 동시에
* **조건 인덱싱**은 기본적으로 행을 선택하기 위함

In [18]:
# 키가 180보다 큰 사람의 이름
df[ df['키'] > 180 ]['이름']

6      민현
11    차은우
Name: 이름, dtype: object

In [19]:
# 키가 170보다 작은 사람의 이름, 그룹, 키
df[ df['키'] < 170 ][['이름','그룹', '키']]

    이름   그룹      키
4   화사  마마무  162.1
9  하성운   핫샷  167.1

In [20]:
# loc로 대체 가능하다.
df.loc[ df['키'] < 170, ['이름', '그룹', '키']]

    이름   그룹      키
4   화사  마마무  162.1
9  하성운   핫샷  167.1

# isin을 활용한 인덱싱
isin을 활용한 색인은 조건을 걸고자 하는 값이 정의한 리스트에 있으면 True

In [21]:
# 조건을 위한 리스트를 만들어 놓는 것
my_condition = ["빅히트", "플레디스"]

# 빅히트 또는 플레디스가 들어있으면 True, 없으면 False - isin
df['소속사'].isin(my_condition)

0      True
1     False
2     False
3      True
4     False
5      True
6      True
7     False
8      True
9     False
10    False
11    False
12     True
13     True
14     True
Name: 소속사, dtype: bool

In [22]:
df.loc[ df['소속사'].isin(my_condition) ]

    이름     그룹   소속사  성별        생년월일      키 혈액형   브랜드평판지수
0   지민  방탄소년단   빅히트  남자  1995-10-13  173.6   A  10523260
3    뷔  방탄소년단   빅히트  남자  1995-12-30  178.0  AB   8073501
5   정국  방탄소년단   빅히트  남자  1997-09-01  178.0   A   5208335
6   민현   뉴이스트  플레디스  남자  1995-08-09  182.3   O   4989792
8    진  방탄소년단   빅히트  남자  1992-12-04  179.2   O   4570308
12  백호   뉴이스트  플레디스  남자  1995-07-21  175.0  AB   3301654
13  JR   뉴이스트  플레디스  남자  1995-06-08  176.0   O   3274137
14  슈가  방탄소년단   빅히트  남자  1993-03-09  174.0   O   2925442

# 결측치(null) 알아보기

## NaN(null) 값이란?
* 아예 값 자체가 없는 것
* 0와 NaN(null)은 같은 개념일까요? -> `No`
  * 휴지걸이에 휴지가 한정도 없이 휴지 심만 있다. -> `0`
  * 휴지걸이에 휴지심조차 없다 -> `NaN(null)`
* `NaN` : pandas, numpy에서 사용되는 개념 ( Not a Number )

In [23]:
# 데이터 프레임의 정보 부터 확인
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 8 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   이름       15 non-null     object
 1   그룹       14 non-null     object
 2   소속사      15 non-null     object
 3   성별       15 non-null     object
 4   생년월일     15 non-null     object
 5   키        13 non-null     float64
 6   혈액형      15 non-null     object
 7   브랜드평판지수  15 non-null     int64
dtypes: float64(1), int64(1), object(6)
memory usage: 1.1+ KB

In [25]:
# NaN값이 어디에 있는지 확인하기 - isna()
df.isna()

       이름     그룹    소속사     성별   생년월일      키    혈액형  브랜드평판지수
0   False  False  False  False  False  False  False    False
1   False  False  False  False  False  False  False    False
2   False   True  False  False  False  False  False    False
3   False  False  False  False  False  False  False    False
4   False  False  False  False  False  False  False    False
5   False  False  False  False  False  False  False    False
6   False  False  False  False  False  False  False    False
7   False  False  False  False  False   True  False    False
8   False  False  False  False  False  False  False    False
9   False  False  False  False  False  False  False    False
10  False  False  False  False  False   True  False    False
11  False  False  False  False  False  False  False    False
12  False  False  False  False  False  False  False    False
13  False  False  False  False  False  False  False    False
14  False  False  False  False  False  False  False    False

In [26]:
# isnull() 함수로도 nan값의 위치를 파악할 수 있다.
df['그룹'].isnull()

0     False
1     False
2      True
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
Name: 그룹, dtype: bool

In [27]:
df['그룹']

0     방탄소년단
1        빅뱅
2       NaN
3     방탄소년단
4       마마무
5     방탄소년단
6      뉴이스트
7       아이들
8     방탄소년단
9        핫샷
10     소녀시대
11     아스트로
12     뉴이스트
13     뉴이스트
14    방탄소년단
Name: 그룹, dtype: object

In [28]:
# df['그룹'][df['그룹'].isna()]
df['그룹'][df['그룹'].isnull()] # isnull()을 더 많이 씀

2    NaN
Name: 그룹, dtype: object

**NaN이 아닌 것**만 색인

In [29]:
df['키'].notnull()

0      True
1      True
2      True
3      True
4      True
5      True
6      True
7     False
8      True
9      True
10    False
11     True
12     True
13     True
14     True
Name: 키, dtype: bool

In [30]:
df['그룹'][df['그룹'].notnull()]

0     방탄소년단
1        빅뱅
3     방탄소년단
4       마마무
5     방탄소년단
6      뉴이스트
7       아이들
8     방탄소년단
9        핫샷
10     소녀시대
11     아스트로
12     뉴이스트
13     뉴이스트
14    방탄소년단
Name: 그룹, dtype: object

In [31]:
# loc를 사용해서 간단하게 사용하기
df.loc[ df['그룹'].notnull(), ['이름', '키', '혈액형'] ]

      이름      키 혈액형
0     지민  173.6   A
1   지드래곤  177.0   A
3      뷔  178.0  AB
4     화사  162.1   A
5     정국  178.0   A
6     민현  182.3   O
7     소연    NaN   B
8      진  179.2   O
9    하성운  167.1   A
10    태연    NaN   A
11   차은우  183.0   B
12    백호  175.0  AB
13    JR  176.0   O
14    슈가  174.0   O